app/mailers/contact_mailer.rb

SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def email_agent agent_id, first_name, last_name, email, message

        @agent = Account.find(agent_id)