app/controllers/admin_controller.rb

    def accounts
        @accounts= Account.where(admin: false)
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."admin" = $1  [["admin", false]]