app/controllers/dashboard_controller.rb

SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "properties".* FROM "properties" WHERE "properties"."account_id" = $1 ORDER BY "properties"."created_at" DESC LIMIT $2  [["account_id", 1], ["LIMIT", 1]]
---
  def profile
    @account = Account.find(params[:id])
    # @property = Property.where(account_id: @account.id).latest.first
    @properties = Property.where(account_id: @account.id)