app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "url", "summary", "body", "image", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save

UPDATE "posts" SET "image" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["image", "MondayCoffee-scaled.jpg"], ["updated_at", "2020-05-13 01:02:01.496223"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @post.update(post_params)