app/controllers/properties_controller.rb

  def update
    respond_to do |format|
      if @property.update(property_params)
---
UPDATE "properties" SET "status" = $1, "updated_at" = $2 WHERE "properties"."id" = $3  [["status", "sold"], ["updated_at", "2020-05-12 03:52:28.939570"], ["id", 1]]