app/controllers/properties_controller.rb

SELECT "properties".* FROM "properties" WHERE "properties"."account_id" = $1 AND "properties"."id" != $2  [["account_id", 1], ["id", 8]]
---
  def show
    @agent = @property.account
    @agent_properties = Property.where(account_id: @agent.id).where.not(id: @property.id)

INSERT INTO "properties" ("account_id", "name", "address", "price", "bathrooms", "photo", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @property = Property.new(property_params)
    @property.account_id = current_account.id

    respond_to do |format|
      if @property.save

UPDATE "properties" SET "available_date" = $1, "updated_at" = $2 WHERE "properties"."id" = $3  [["available_date", "2020-06-06 00:00:00"], ["updated_at", "2020-05-10 03:12:38.629665"], ["id", 7]]
---
  def update
    respond_to do |format|
      if @property.update(property_params)