app/controllers/public_controller.rb

SELECT "properties".* FROM "properties" ORDER BY "properties"."created_at" DESC
SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC
---
  def main

    if account_signed_in?
      path = current_account.admin? ? accounts_path : dashboard_path
      redirect_to path, flash: {success: " Successfully signed in. Welcome to Property Finder"} and return
    end

    @properties = Property.latest
    @posts = Post.latest